## Solutions to Exercises: Session 4
In the exercices, we will keep working with the Titanic Dataframe. So, make sure to load the data in a first step (and don't forget to load the pandas and numpy modules as well).

1. Verify that the variable 'PassengerId' is of type 'int64'. Then change it to string (or object) datatype. Why does this make sense?
2. Print the first 7 rows of the dataframe.
3. Print the last 3 values of the 'Embarked' column.
4. Add a column 'upper_class' that takes the value 1 if a passenger travelled 1st class and 0 otherwise.
5. Add a colum 'family_size' that captures the number of parents/children/siblings/spouses that a passenger had onboard.

In [1]:
# load modules
import pandas as pd
import numpy as np
# load the data
df_titanic = pd.read_csv('../python_basics_johanna/data/titanic.csv')

1. Verify that the variable 'PassengerId' is of type 'int64'. Then change it to string (or object) datatype. Why does this make sense?

In [2]:
# Check the datatype of columns (including 'PassengerId')
df_titanic['PassengerId'].dtypes
# or:
df_titanic['PassengerId'].describe()

count    891.000000
mean     446.000000
std      257.353842
min        1.000000
25%      223.500000
50%      446.000000
75%      668.500000
max      891.000000
Name: PassengerId, dtype: float64

In [3]:
# Convert to string
df_titanic['PassengerId'] = df_titanic['PassengerId'].astype(int).astype(str)
df_titanic['PassengerId'].describe()

count     891
unique    891
top       636
freq        1
Name: PassengerId, dtype: object

Conversion makes sense b/c the only purpose of 'PassengerId' is to provide an unambiguous identification of passengers - the number itself has no (quantitative) meaning.

2. Print the first 7 rows of the dataframe.

In [4]:
df_titanic.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

3. Print the last 3 values of the 'Embarked' column.

In [5]:
df_titanic['Embarked'].tail(3)

888    S
889    C
890    Q
Name: Embarked, dtype: object

4. Add a column 'upper_class' that takes the value 1 if a passenger travelled 1st class and 0 otherwise.

In [6]:
# Initiate column
df_titanic['upper_class'] = None
# 'upper_class' takes the value 1 if 'Pclass' equals 1, 0 otherwise
df_titanic.loc[df_titanic['Pclass'] == 1, 'upper_class'] = 1
df_titanic.loc[df_titanic['Pclass'] != 1, 'upper_class'] = 0

In [7]:
# Check if we did a good job
df_titanic['upper_class'].describe()

count    891.000000
mean       0.242424
std        0.428790
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max        1.000000
Name: upper_class, dtype: float64

In [8]:
df_titanic[['Name', 'Pclass', 'upper_class']].head(10)
# looks good ...

                                                Name  Pclass  upper_class
0                            Braund, Mr. Owen Harris       3            0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1            1
2                             Heikkinen, Miss. Laina       3            0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1            1
4                           Allen, Mr. William Henry       3            0
5                                   Moran, Mr. James       3            0
6                            McCarthy, Mr. Timothy J       1            1
7                     Palsson, Master. Gosta Leonard       3            0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3            0
9                Nasser, Mrs. Nicholas (Adele Achem)       2            0

5. Add a colum 'family_size' that captures the number of parents/children/siblings/spouses that a passenger had onboard.

In [9]:
df_titanic['family_size'] = df_titanic['Parch'] + df_titanic['SibSp']
df_titanic[['Name', 'Parch', 'SibSp', 'family_size']].head(10)

,Name,Parch,SibSp,family_size
0,"Braund, Mr. Owen Harris",0,1,1
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,1
2,"Heikkinen, Miss. Laina",0,0,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,1
4,"Allen, Mr. William Henry",0,0,0
5,"Moran, Mr. James",0,0,0
6,"McCarthy, Mr. Timothy J",0,0,0
7,"Palsson, Master. Gosta Leonard",1,3,4
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,0,2
9,"Nasser, Mrs. Nicholas (Adele Achem)",0,1,1